#include<stdio.h>
//int check_sys()
//{
//	int a = 1;
//	return *(char*) & a;
//}
//int main()
//{
//	int ret = check_sys();
//	if (ret == 1)
//		printf("小端\n");
//	else
//		printf("大端\n");
//	return 0;
//}
//整形提升是负数补1；正数补0；
// 原码10000000000000000000000000000001
// 反码11111111111111111111111111111110
// 补码11111111111111111111111111111111
//char类型取后八位11111111
//转换成int类型，整形提升11111111111111111111111111111111
//                  取反10000000000000000000000000000000
//                  加一10000000000000000000000000000001     为-1

//c转换成char类型为111111111
//无符号数整形提升后00000000000000000000000011111111     为255
int main()
{
	char a = -1;     //a和b一样
	signed b = -1;
	unsigned char c = -1;
	printf("%d %d %d", a, b, c);
	return 0;
}